Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GA110.h
#define _RPINR21_U3CTSR0_POSITION                0x00000008
#define _RPINR21_U3CTSR0_MASK                    0x00000100
#define _RPINR21_U3CTSR0_LENGTH                  0x00000001

#define _RPINR21_U3CTSR1_POSITION                0x00000009
#define _RPINR21_U3CTSR1_MASK                    0x00000200
#define _RPINR21_U3CTSR1_LENGTH                  0x00000001

#define _RPINR21_U3CTSR2_POSITION                0x0000000A
#define _RPINR21_U3CTSR2_MASK                    0x00000400
#define _RPINR21_U3CTSR2_LENGTH                  0x00000001

#define _RPINR21_U3CTSR3_POSITION                0x0000000B
#define _RPINR21_U3CTSR3_MASK                    0x00000800
#define _RPINR21_U3CTSR3_LENGTH                  0x00000001

#define _RPINR21_U3CTSR4_POSITION                0x0000000C
#define _RPINR21_U3CTSR4_MASK                    0x00001000
#define _RPINR21_U3CTSR4_LENGTH                  0x00000001

#define _RPINR21_U3CTSR5_POSITION                0x0000000D
#define _RPINR21_U3CTSR5_MASK                    0x00002000
#define _RPINR21_U3CTSR5_LENGTH                  0x00000001

#define _RPINR22_SDI2R_POSITION                  0x00000000
#define _RPINR22_SDI2R_MASK                      0x0000003F
#define _RPINR22_SDI2R_LENGTH                    0x00000006

#define _RPINR22_SCK2R_POSITION                  0x00000008
#define _RPINR22_SCK2R_MASK                      0x00003F00
#define _RPINR22_SCK2R_LENGTH                    0x00000006

#define _RPINR22_SDI2R0_POSITION                 0x00000000
#define _RPINR22_SDI2R0_MASK                     0x00000001
#define _RPINR22_SDI2R0_LENGTH                   0x00000001

#define _RPINR22_SDI2R1_POSITION                 0x00000001
#define _RPINR22_SDI2R1_MASK                     0x00000002
#define _RPINR22_SDI2R1_LENGTH                   0x00000001

#define _RPINR22_SDI2R2_POSITION                 0x00000002
#define _RPINR22_SDI2R2_MASK                     0x00000004
#define _RPINR22_SDI2R2_LENGTH                   0x00000001

#define _RPINR22_SDI2R3_POSITION                 0x00000003
#define _RPINR22_SDI2R3_MASK                     0x00000008
#define _RPINR22_SDI2R3_LENGTH                   0x00000001

#define _RPINR22_SDI2R4_POSITION                 0x00000004
#define _RPINR22_SDI2R4_MASK                     0x00000010
#define _RPINR22_SDI2R4_LENGTH                   0x00000001

#define _RPINR22_SDI2R5_POSITION                 0x00000005
#define _RPINR22_SDI2R5_MASK                     0x00000020
#define _RPINR22_SDI2R5_LENGTH                   0x00000001

#define _RPINR22_SCK2R0_POSITION                 0x00000008
#define _RPINR22_SCK2R0_MASK                     0x00000100
#define _RPINR22_SCK2R0_LENGTH                   0x00000001

#define _RPINR22_SCK2R1_POSITION                 0x00000009
#define _RPINR22_SCK2R1_MASK                     0x00000200
#define _RPINR22_SCK2R1_LENGTH                   0x00000001

#define _RPINR22_SCK2R2_POSITION                 0x0000000A
#define _RPINR22_SCK2R2_MASK                     0x00000400
#define _RPINR22_SCK2R2_LENGTH                   0x00000001

#define _RPINR22_SCK2R3_POSITION                 0x0000000B
#define _RPINR22_SCK2R3_MASK                     0x00000800
#define _RPINR22_SCK2R3_LENGTH                   0x00000001

#define _RPINR22_SCK2R4_POSITION                 0x0000000C
#define _RPINR22_SCK2R4_MASK                     0x00001000
#define _RPINR22_SCK2R4_LENGTH                   0x00000001

#define _RPINR22_SCK2R5_POSITION                 0x0000000D
#define _RPINR22_SCK2R5_MASK                     0x00002000
#define _RPINR22_SCK2R5_LENGTH                   0x00000001

#define _RPINR23_SS2R_POSITION                   0x00000000
#define _RPINR23_SS2R_MASK                       0x0000003F
#define _RPINR23_SS2R_LENGTH                     0x00000006

#define _RPINR23_SS2R0_POSITION                  0x00000000
#define _RPINR23_SS2R0_MASK                      0x00000001
#define _RPINR23_SS2R0_LENGTH                    0x00000001

#define _RPINR23_SS2R1_POSITION                  0x00000001
#define _RPINR23_SS2R1_MASK                      0x00000002
#define _RPINR23_SS2R1_LENGTH                    0x00000001

#define _RPINR23_SS2R2_POSITION                  0x00000002
#define _RPINR23_SS2R2_MASK                      0x00000004
#define _RPINR23_SS2R2_LENGTH                    0x00000001

#define _RPINR23_SS2R3_POSITION                  0x00000003
#define _RPINR23_SS2R3_MASK                      0x00000008
#define _RPINR23_SS2R3_LENGTH                    0x00000001

#define _RPINR23_SS2R4_POSITION                  0x00000004
#define _RPINR23_SS2R4_MASK                      0x00000010
#define _RPINR23_SS2R4_LENGTH                    0x00000001

#define _RPINR23_SS2R5_POSITION                  0x00000005
#define _RPINR23_SS2R5_MASK                      0x00000020
#define _RPINR23_SS2R5_LENGTH                    0x00000001

#define _RPINR27_U4RXR_POSITION                  0x00000000
#define _RPINR27_U4RXR_MASK                      0x0000003F
#define _RPINR27_U4RXR_LENGTH                    0x00000006

#define _RPINR27_U4CTSR_POSITION                 0x00000008
#define _RPINR27_U4CTSR_MASK                     0x00003F00
#define _RPINR27_U4CTSR_LENGTH                   0x00000006

#define _RPINR27_U4RXR0_POSITION                 0x00000000
#define _RPINR27_U4RXR0_MASK                     0x00000001
#define _RPINR27_U4RXR0_LENGTH                   0x00000001

#define _RPINR27_U4RXR1_POSITION                 0x00000001
#define _RPINR27_U4RXR1_MASK                     0x00000002
#define _RPINR27_U4RXR1_LENGTH                   0x00000001

#define _RPINR27_U4RXR2_POSITION                 0x00000002
#define _RPINR27_U4RXR2_MASK                     0x00000004
#define _RPINR27_U4RXR2_LENGTH                   0x00000001

#define _RPINR27_U4RXR3_POSITION                 0x00000003
#define _RPINR27_U4RXR3_MASK                     0x00000008
#define _RPINR27_U4RXR3_LENGTH                   0x00000001

#define _RPINR27_U4RXR4_POSITION                 0x00000004
#define _RPINR27_U4RXR4_MASK                     0x00000010
#define _RPINR27_U4RXR4_LENGTH                   0x00000001

#define _RPINR27_U4RXR5_POSITION                 0x00000005
#define _RPINR27_U4RXR5_MASK                     0x00000020
#define _RPINR27_U4RXR5_LENGTH                   0x00000001

